app/controllers/information_controller.rb

  def index
    @information = Information.all
---
SELECT * FROM `information`