app/controllers/mywins_controller.rb

SELECT * FROM `mywins`
---
  def index
    @mywins = Mywin.all

SELECT * FROM `mywins` WHERE (`mywins`.`id` = 1)
---
  def show
    @mywin = Mywin.find(params[:id])

INSERT INTO `mywins` (`address`, `accept`, `created_at`, `phonenumber`, `updated_at`, `windowslayout`, `numberofwindows`, `windowsdescription`, `points`, `areacode`, `surname`, `initial`) VALUES('12 Eindhoven Dutch', 1, '2010-04-08 12:48:21', 343, '2010-04-08 12:48:21', 0, 4, 'Yo man', 22, '43243', 'Singh', 'S')
---
  def create
    @mywin = Mywin.new(params[:mywin])

    respond_to do |format|
      if @mywin.save