app/controllers/reactions_controller.rb

SELECT * FROM `reactions`
---
  def index
    @reactions = Reaction.all