app/controllers/searchoffers_controller.rb

  def index
    @searchoffers = Searchoffer.all
---
SELECT * FROM `searchoffers`